---
kind: property
id: P:Autodesk.Revit.DB.Structure.Rebar.IncludeLastBar
zh: 钢筋、配筋
source: html/5b3663d8-9b7f-12de-d20a-895259bea9ac.htm
---
# Autodesk.Revit.DB.Structure.Rebar.IncludeLastBar Property

**中文**: 钢筋、配筋

Identifies if the last bar in rebar set is shown.

## Syntax (C#)
```csharp
public bool IncludeLastBar { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - This rebar element represents a single bar (the layout rule is Single).